<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es">

<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<title>SPANISH - Non Official Translation - GNU General Public License v3 - GNU Project - Free Software Foundation (FSF)</title>
<link rel="stylesheet" type="text/css" href="http://www.gnu.org/gnu-new.css" title="All-new GNU Project style" />
</head>

<body>

<div id="content" style="margin-left:5%;">

<blockquote><p>
This is an unofficial translation of the GNU General Public License into <tt>spanish</tt>.  It was not published by the Free Software Foundation, and does not legally state the distribution terms for software that uses the GNU GPL&mdash;only the original English text of the GNU GPL does that.  However, we hope that this translation will help <tt>spanish</tt> speakers understand the GNU GPL better.
</p></blockquote>

<blockquote><p>
Esta es una traducci&oacute;n no oficial de la Licencia P&uacute;blica General GNU (GNU GPL) al <tt>espa&ntilde;ol</tt>. No fue publicada por la Fundaci&oacute;n para el Software Libre, y  no establece legalmente los t&eacute;rminos de distribuci&oacute;n para software que utiliza la GNU GPL&mdash;s&oacute;lamente el texto original en ingl&eacute;s de la GNU GPL hace eso. De todas formas, esperamos que esta traducci&oacute;n ayude a los <tt>hispanohablantes</tt> a comprender mejor la GNU GPL.
</p></blockquote>


<hr />

<h3 style="text-align: center;">LICENCIA P&Uacute;BLICA GENERAL GNU</h3>
<p style="text-align: center;">Versi&oacute;n 3, 29 de junio de 2007</p>

<p>Copyright (C) 2007 Free Software Foundation, Inc. &lt;http://fsf.org/&gt;</p>
<p>
 Se permite la copia y distribuci&oacute;n de copias literales de esta licencia, pero no est&aacute; permitido modificarla. </p>

<h3><a name="preamble"></a>Pre&aacute;mbulo</h3>

<p>La Licencia P&uacute;blica General GNU (GNU GPL) es una licencia libre, sin derechos para software y otro tipo de trabajos.</p>

<p>Las licencias para la mayor&iacute;a del software y otros trabajos pr&aacute;cticos est&aacute;n destinadas a suprimir la libertad de compartir y modificar esos trabajos. Por el contrario, la Licencia P&uacute;blica General GNU persigue garantizar su libertad para compartir y modificar todas las versiones de un programa--y asegurar que permanecer&aacute; como software libre para todos sus usuarios. Nosotros, La Fundaci&oacute;n de Software Libre, usamos la Licencia P&uacute;blica General GNU para la mayor&iacute;a de nuestro software; y tambi&eacute;n se aplica a cualquier trabajo realizado de la misma forma por sus autores. Usted tambi&eacute;n puede aplicarla a sus programas.</p>

<p>Cuando hablamos de software libre, nos referimos a libertad, no a precio. Nuestras Licencias P&uacute;blicas Generales est&aacute;n destinadas a garantizar la libertad de distribuir copias de software libre (y cobrar por ello si quiere), a recibir el c&oacute;digo fuente o poder conseguirlo si as&iacute; lo desea, a modificar el software o usar parte del mismo en nuevos programas libres, y a saber que puede hacer estas cosas.</p>

<p>Para proteger sus derechos, necesitamos evitar que otros le nieguen esos derechos o le pidan renunciar a ellos. Por lo tanto, usted tiene ciertas responsabilidades cuando distribuye copias del software, o si lo modifica: responsabilidades que persiguen respetar la libertad de otros.</p>

<p>Por ejemplo, si distribuye copias de tales programas, gratuitamente o no, debe transmitir a los destinatarios los mismos derechos que usted recibi&oacute;. Debe asegurarse que ellos tambi&eacute;n reciban o puedan conseguir el c&oacute;digo fuente. Y debe mostrarles estos t&eacute;rminos y condiciones para que conozcan sus derechos.</p>

<p>Los desarrolladores que usen la GPL GNU protegen sus derechos de dos formas: (1) imponen derechos al software, y (2) le ofrecen esta Licencia para que legalmente lo copie, distribuya y/o modifique.</p>

<p>Para proteger a desarrolladores y autores, la GPL expone claramente que no existe garant&iacute;a alguna para este software libre. Para beneficio de ambos, usuarios y autores, la GPL establece que las versiones modificadas deber&aacute;n estar identificadas como tales, para que cualquier problema no sea atribuido por error a los autores de versiones anteriores.</p>

<p>Algunos dispositivos est&aacute;n dise&ntilde;ados para negar al usuario la instalaci&oacute;n o la ejecuci&oacute;n de versiones modificadas del software que usan internamente, aunque el fabricante s&iacute; pueda hacerlo. Esto es completamente incompatible con el objetivo de proteger la libertad de los usuarios para modificar el software. Este tipo de abuso sistem&aacute;tico ocurre con productos de uso personal, que es precisamente donde es menos aceptable. Por tanto, hemos dise&ntilde;ado esta versi&oacute;n de la GPL para prohibir estas pr&aacute;cticas en esos productos. Si apareciesen problemas similares en otros &aacute;mbitos, estaremos preparados para extender estas prestaciones a las pr&oacute;ximas versiones de la GPL, tanto como sea necesario para proteger la libertad de los usuarios.</p>

<p>Por &uacute;ltimo, todo programa est&aacute; constantemente amenazado por las patentes de software. Los estados no deber&iacute;an permitir que las patentes restrinjan el desarrollo y el uso de software en ordenadores de uso general; pero en aquellos que lo hagan, esperamos evitar el especial peligro que suponen las patentes, que aplicadas a un programa libre puedan hacerlo propietario en la pr&aacute;ctica. Para prevenir eso, la GPL establece que las patentes no pueden usarse para convertir un programa en no-libre.</p>

<p>A continuaci&oacute;n se exponen los t&eacute;rminos y condiciones para la copia, distribuci&oacute;n y modificaci&oacute;n.</p>

<h3><a name="terms"></a>T&Eacute;RMINOS Y CONDICIONES</h3>

<h4><a name="section0"></a>0. Definiciones.</h4>

<p>En adelante &ldquo;Esta Licencia&rdquo; se refiere a la versi&oacute;n 3 de la Licencia P&uacute;blica General GNU.</p>

<p>"Copyright" tambi&eacute;n significa "leyes similares al copyright" que son aplicables a otro tipo de trabajos, tales como las m&aacute;scaras de semiconductores.</p>
 
<p>"El Programa" se refiere a cualquier trabajo con copyright al que se haya aplicado esta Licencia. Cada beneficiario  es asimilable a "usted". "Beneficiarios" y "destinatarios" pueden ser personas f&iacute;sicas u organizaciones.</p>

<p>"Modificar" un trabajo significa copiar o adaptar todo o parte de un trabajo, exceptuando la copia exacta, de manera que se requiera permiso de copyright. El trabajo resultante se denomina "versi&oacute;n modificada" de un trabajo anterior o trabajo "basado en" el trabajo anterior. </p>

<p>Un "trabajo amparado" puede ser tanto el Programa no modificado como un trabajo basado en el Programa. </p>

<p>"Difundir" un trabajo significa hacer cualquier cosa con &eacute;l, sin permiso, que le haga directa o indirectamente responsable de infringir leyes cubiertas por copyright, excepto la ejecuci&oacute;n en un ordenador o la modificaci&oacute;n de una copia privada. La difusi&oacute;n incluye la copia, distribuci&oacute;n (con o sin modificaciones), distribuci&oacute;n p&uacute;blica, y en algunos pa&iacute;ses tambi&eacute;n otras actividades. </p>

<p>"Distribuir" un trabajo implica cualquier tipo de difusi&oacute;n que permite a la otra parte hacer o recibir copias. La mera interacci&oacute;n con un usuario mediante una red de ordenadores, sin transferir copia alguna, no se considera "distribuci&oacute;n". </p>

<p>Una interfaz de usuario interactiva muestra "Avisos Legales Apropiados" siempre y cuando incluya caracter&iacute;sticas visuales apropiadas y destacadas que (1) muestren un aviso de copyright apropiado, y (2) indiquen al usuario que no existe garant&iacute;a alguna para el trabajo (exceptuando las garant&iacute;as que se hayan podido establecer), que los beneficiarios deben distribuir el trabajo seg&uacute;n se establece en la presente Licencia, y c&oacute;mo se puede ver una copia de esta Licencia. Si la interfaz muestra una lista de opciones o comandos, tales como men&uacute;s, un elemento destacado en dicha lista cumple estos criterios.</p>

<h4><a name="section1"></a>1. C&oacute;digo Fuente.</h4>

<p>El "c&oacute;digo fuente" de un trabajo es el formato preferido para realizar modificaciones sobre &eacute;l. "C&oacute;digo objeto" se refiere a cualquier formato del trabajo que no sea c&oacute;digo fuente. </p>

<p>Una "Interfaz Est&aacute;ndar" se refiere a una interfaz que sea o bien un est&aacute;ndar oficial definido por una instituci&oacute;n de est&aacute;ndares reconocida, o bien, en el caso de interfaces espec&iacute;ficos para una determinado lenguaje de programaci&oacute;n, una cuyo uso est&eacute; generalizada entre los desarrolladores que trabajan con ese lenguaje. </p>

<p>Las "Bibliotecas de Sistema" de un trabajo ejecutable incluyen a cualquier elemento, que no sea el trabajo completo, que (a) est&eacute; incluida/o de la misma forma que un componente principal, pero que no forme parte de ese componente principal, y (b) s&oacute;lo sirva para habilitar la utilizaci&oacute;n del trabajo a trav&eacute;s de ese componente principal, o para implementar un Interfaz Est&aacute;ndar para el cual est&aacute; disponible una implementaci&oacute;n p&uacute;blica en c&oacute;digo fuente. Un "Componente Principal", en este contexto, se refiere a un componente principal y esencial (n&uacute;cleo, sistema de ventanas y similares) del sistema operativo particular (en su caso) sobre el cual funcione el ejecutable, o un compilador utilizado para generar el trabajo, o un int&eacute;rprete del c&oacute;digo objeto utilizado para ejecutarlo.</p>

<p>La "Fuente Correspondiente" de un trabajo en c&oacute;digo objeto se refiere a todo c&oacute;digo fuente necesario para generar, instalar, y (en el caso de trabajos ejecutables) ejecutar el c&oacute;digo objeto y modificar el trabajo, incluyendo guiones que controlen esas actividades. Sin embargo, no se incluyen las Bibliotecas de Sistema del trabajo, o herramientas de prop&oacute;sito general o programas gratuitos habitualmente disponibles y usados sin ninguna modificaci&oacute;n para realizar estas actividades pero que no forman parte del trabajo. Por ejemplo, la Fuente Correspondiente incluye los archivos de definici&oacute;n de interfaz asociados con archivos fuente del trabajo, y el c&oacute;digo fuente de las bibliotecas compartidas o subprogramas enlazados din&aacute;micamente que el programa requiere por dise&ntilde;o, como la comunicaci&oacute;n de datos intr&iacute;nseca o el control de flujo entre esos subprogramas y otras partes del trabajo. </p>

<p>La Fuente Correspondiente no incluye necesariamente aquello que los usuarios pueden regenerar autom&aacute;ticamente a partir de otras partes de la Fuente Correspondiente. </p>

<p>La Fuente Correspondiente de un trabajo en c&oacute;digo fuente es ese mismo trabajo. </p>

<h4><a name="section2"></a>2. Permisos B&aacute;sicos.</h4>

<p>Todos los derechos garantizados por esta Licencia se otorgan como copyright del Programa, y se proporcionan de manera irrevocable siempre y cuando se cumplan las condiciones establecidas. Esta Licencia afirma expl&iacute;citamente su permiso ilimitado para ejecutar el Programa sin modificaciones. El resultado de la ejecuci&oacute;n de un programa amparado est&aacute; cubierto por esta Licencia s&oacute;lo en el caso de que la salida, por su contenido, constituya un trabajo amparado. Esta Licencia reconoce sus derechos de uso razonable u otro equivalente, tal y como determina la ley de copyright.</p>

<p>Usted podr&aacute; realizar, ejecutar y difundir trabajos amparados que no distribuya, sin condici&oacute;n alguna, siempre y cuando no tenga otra licencia m&aacute;s restrictiva. Podr&aacute; distribuir trabajos amparados a terceros con el mero objetivo de que ellos hagan modificaciones exclusivamente para usted, o para que le proporcionen ayuda para ejecutar esos trabajos, siempre que cumpla los t&eacute;rminos de esta Licencia distribuyendo todo el material de cuyo copyright no posee el control. Aquellos que realicen o ejecuten los trabajos amparados para usted deben hacerlo exclusivamente en su nombre, bajo su direcci&oacute;n y control, con t&eacute;rminos que les proh&iacute;ban realizar copias de su material con copyright al margen de la relaci&oacute;n con usted.</p>

<p>La distribuci&oacute;n bajo otras circunstancias se permite &uacute;nicamente bajo las condiciones establecidas m&aacute;s abajo. No est&aacute; permitido sublicenciar; la cla&uacute;sula 10 lo hace innecesario. </p>

<h4><a name="section3"></a>3. Protecci&oacute;n de Derechos Legales de los Usuarios frente a Leyes Anti-Burla.</h4>

<p>Ning&uacute;n trabajo amparado debe considerarse parte de una medida tecnol&oacute;gica efectiva, a tenor de lo establecido en cualquier ley aplicable que cumpla las obligaciones expresas en el art&iacute;culo 11 del tratado de copyright WIPO adoptado el 20 de diciembre de 1996, o leyes similares que proh&iacute;ben o restringen la burla de tales medidas.</p>

<p>Cuando distribuya un trabajo amparado, renuncia a cualquier poder legal para prohibir la burla de medidas tecnol&oacute;gicas mientras tales burlas se realicen en ejercicio de derechos amparados por esta Licencia respecto al trabajo amparado; adem&aacute;s, usted negar&aacute; cualquier intenci&oacute;n de limitar el uso o modificaci&oacute;n del trabajo con el objetivo de imponer, al trabajo de los usuarios, sus derechos legales o de terceros para prohibir la burla de medidas tecnol&oacute;gicas. </p>

<h4><a name="section4"></a>4. Distribuci&oacute;n de copias literales.</h4>

<p>Usted podr&aacute; distribuir copias literales del c&oacute;digo fuente del Programa tal y como lo ha recibido , por cualquier medio, siempre que publique de forma clara y llamativa en cada copia el correspondiente aviso de copyright ; mantenga intactos todos los avisos que establezcan que esta Licencia y cualquier t&eacute;rmino no-permisivo a&ntilde;adido y acorde con la cl&aacute;usula 7 son aplicables al c&oacute;digo; mantenga intactos todos los avisos de ausencia de garant&iacute;a; y proporcione a todos los destinatarios una copia de esta Licencia junto con el Programa.</p>

<p>Usted podr&aacute; cobrar cualquier importe o no cobrar nada por cada copia que distribuya, y podr&aacute; ofrecer soporte o protecci&oacute;n de garant&iacute;a mediante un pago.</p>

<h4><a name="section5"></a>5. Distribuci&oacute;n de Versiones Modificadas de C&oacute;digo.</h4>

<p>Usted podr&aacute; distribuir un trabajo basado en el Programa, o las modificaciones que lo producen a partir del Programa, como c&oacute;digo fuente en virtud de los t&eacute;rminos establecidos en la cl&aacute;usula 4, siempre que cumpla todas las condiciones siguientes: </p>

<ul>
<li>a) El trabajo debe incluir avisos destacados indicando que usted lo ha modificado y dando una fecha pertinente.</li>

<li>b) El trabajo debe incluir avisos destacados indicando que est&aacute; realizado a tenor de lo dispuesto en la presente Licencia y en cualquier otra condici&oacute;n a&ntilde;adida en virtud de la cl&aacute;usula 7. Este requisito modifica el requisito de "mantener intactos todos los avisos" expuesto en la cla&uacute;sula 4.</li>

<li>c) En virtud del presente documento, usted deber&aacute; aplicar la licencia al trabajo completo, como un todo, a cualquier persona que est&eacute; en posesi&oacute;n de una copia. Por lo tanto, esta Licencia se aplicar&aacute; junto con cualquier otra condici&oacute;n adicional aplicable de la cl&aacute;usula 7, al conjunto completo del trabajo y todas y cada una de sus partes, independientemente de como sean agrupadas o empaquetadas. Esta Licencia no permite ser aplicada al trabajo de ninguna otra forma, pero no se anula dicho permiso si usted lo ha recibido por separado.</li>

<li>d) Si el trabajo tiene interfaces de usuario interactivos, cada uno debe mostrar Avisos Legales Apropiados; sin embargo, si el Programa tiene interfaces interactivos que no muestran Avisos Legales Apropiados, su trabajo no tiene porqu&eacute; modificarlos para que lo hagan.</li>
</ul>

<p>Un conjunto o recopilaci&oacute;n formado por un trabajo amparado y otros trabajos distintos e independientes, que por su naturaleza no sean ampliaciones del trabajo amparado, que no se combinen con &eacute;l de alguna forma para dar lugar a un programa mayor, y que est&eacute;n ubicados en un medio de distribuci&oacute;n o almacenamiento, se denomina "paquete" si la recopilaci&oacute;n y su copyright al completo no son usados para limitar el acceso o los derechos legales de los usuarios de la recopilaci&oacute;n, m&aacute;s all&aacute; de lo que permita el trabajo individual. La inclusi&oacute;n de un trabajo amparado en un paquete no hace aplicable esta Licencia al resto de elementos del paquete.</p>

<h4><a name="section6"></a>6. Distribuci&oacute;n de c&oacute;digo No-fuente.</h4>

<p>Usted podr&aacute; distribuir el c&oacute;digo objeto de un trabajo amparado en virtud de los t&eacute;rminos de las cl&aacute;usulas 4 y 5, siempre que tambi&eacute;n distribuya las Fuentes Correspondientes en c&oacute;digo m&aacute;quina, de acuerdo con los t&eacute;rminos establecidos en esta Licencia, de alguna de las siguientes maneras: </p>

<ul>
<li>a) Distribuir el c&oacute;digo objeto en, o embebido en, un producto f&iacute;sico (incluyendo medios de distribuci&oacute;n f&iacute;sicos), acompa&ntilde;ado de las Fuentes Correspondientes en un medio f&iacute;sico duradero y que sea utilizado habitualmente para el intercambio de software.</li>

<li>b) Distribuir el c&oacute;digo objeto en, o embebido en, un producto f&iacute;sico (incluyendo medios de distribuci&oacute;n f&iacute;sicos), acompa&ntilde;ado de una oferta por escrito, v&aacute;lida al menos durante tres a&ntilde;os y v&aacute;lida durante el tiempo en el que usted ofrezca recambios o soporte para ese modelo de producto, con el fin de ofrecer al poseedor del c&oacute;digo objeto (1) una copia de las Fuentes Correspondientes a todo el software del producto que est&eacute; cubierto por esta Licencia, en un medio f&iacute;sico duradero habitual para el intercambio de software, a un precio no mayor que su coste razonable por distribuir f&iacute;sicamente las fuentes, o (2) acceso para copiar las fuentes correspondientes desde un servidor de red sin coste alguno.</li>

<li>c) Distribuir copias individuales del c&oacute;digo objeto junto con una copia de la oferta por escrito para/con el fin de proporcionar las Fuentes Correspondientes. Esta alternativa s&oacute;lo est&aacute; permitida ocasionalmente, pero no de forma comercial, y solamente si usted recibi&oacute; el c&oacute;digo objeto junto con una oferta parecida, de acuerdo con la subcl&aacute;usula 6b.</li>

<li>d) Distribuir el c&oacute;digo objeto ofreciendo acceso desde un lugar determinado (gratuitamente o mediante pago), y ofrecer acceso equivalente a las Fuentes Correspondientes de la misma forma y en el mismo lugar sin cargo a&ntilde;adido. No es necesario exigir a los destinatarios que copien las Fuentes Correspondientes junto con el c&oacute;digo objeto. Si el lugar para copiar el c&oacute;digo objeto es un servidor de red, las Fuentes Correspondientes pueden estar en un servidor diferente (gestionado por usted o terceros) que ofrezca facilidades de copia equivalentes, siempre que mantenga instrucciones claras junto al c&oacute;digo objeto especificando d&oacute;nde encontrar las Fuentes Correspondientes. Independientemente de qu&eacute; servidores alberguen las Fuentes Correspondientes, usted seguir&aacute; obligado a asegurar que estar&aacute;n disponibles durante el tiempo necesario para cumplir estos requisitos.</li>

<li>e) Distribuir el c&oacute;digo mediante transferencias entre usuarios, siempre que informe a otros usuarios d&oacute;nde se ofrecen el c&oacute;digo objeto y las Fuentes Correspondientes de forma p&uacute;blica sin cargo alguno, tal y como se establece en la subcl&aacute;usula 6d. </li>
</ul>

<p>Una parte separable del c&oacute;digo objeto, cuyo c&oacute;digo fuente est&eacute; excluido de las Fuentes Correspondientes como Biblioteca de Sistema, no necesita ser incluida en la distribuci&oacute;n del c&oacute;digo objeto del trabajo.</p>

<p>Un "Producto de Usuario" es tanto (1) un "producto de consumo", que se refiere a cualquier propiedad personal tangible habitualmente utilizada para fines personales, familiares o dom&eacute;sticos, o (2) cualquier cosa dise&ntilde;ada o vendida para ser incorporada como extensi&oacute;n/expansi&oacute;n para otro producto. Para determinar si un producto es un producto de consumo, los casos dudosos se resolver&aacute;n favoreciendo el amparo. En el caso de un producto concreto recibido por un usuario particular, "de uso habitual" se refiere al uso t&iacute;pico o corriente de ese tipo de producto, independientemente de la situaci&oacute;n del usuario particular o de la forma en que el usuario concreto  utilice, o pretenda o se espere que pretenda utilizar, el producto. Un producto es un producto de consumo independientemente de si el producto tiene usos sustancialmente comerciales, industriales o distintos del consumo, a menos que tales usos representen la &uacute;nica forma posible de utilizar el producto. </p>

<p>Las "Instrucciones de Instalaci&oacute;n" para un Producto de Usuario se refieren a cualquier m&eacute;todo, procedimiento, clave de autorizaci&oacute;n, u otro tipo de informaci&oacute;n necesaria para instalar y ejecutar una versi&oacute;n modificada de un trabajo amparado en ese Producto de Usuario a partir de una versi&oacute;n modificada de las Fuentes Correspondientes. Las instrucciones deben ser suficientes para asegurar el funcionamiento continuo del c&oacute;digo objeto modificado sin ning&uacute;n tipo de condicionamiento o intromisi&oacute;n por el simple hecho de haber sido modificado.</p>

<p>Si, bajo las premisas de esta cl&aacute;usula, usted distribuye el c&oacute;digo objeto de un trabajo en, o con un Producto de Usuario o espec&iacute;ficamente para ser usado en el mismo, y la distribuci&oacute;n forma parte de una transacci&oacute;n donde los derechos de posesi&oacute;n y uso del Producto de Usuario se transfieren al destinatario a perpetuidad o durante un plazo fijo de tiempo (independientemente de las caracter&iacute;sticas de la transacci&oacute;n), las Fuentes Correspondientes distribuidas bajo estos supuestos deben acompa&ntilde;arse de las Instrucciones de Instalaci&oacute;n. Sin embargo, estos requerimientos no se aplican si ni usted ni terceros tienen posibilidad de instalar el c&oacute;digo objeto modificado en el Producto de Usuario (por ejemplo, el trabajo ha sido instalado en memoria de s&oacute;lo lectura, ROM): </p>

<p>El requerimiento de proporcionar Informaci&oacute;n de Instalaci&oacute;n no incluye el hecho de continuar proporcionando servicio de soporte, garant&iacute;a, o actualizaciones para un trabajo que haya sido modificado o instalado por el destinatario, o para el Producto de Usuario en el que se haya modificado o instalado. El acceso a la red puede ser denegado cuando la propia modificaci&oacute;n afecte materialmente y de forma adversa a la operaci&oacute;n de la red o viole las reglas y protocolos de comunicaci&oacute;n en la red. </p>

<p>Las Fuentes Correspondientes distribuidas, y las Instrucciones de Instalaci&oacute;n proporcionadas de acuerdo con esta cl&aacute;usula, deben figurar en un formato documentado p&uacute;blicamente (y con una implementaci&oacute;n disponible para el p&uacute;blico en c&oacute;digo fuente), y no deben necesitar claves de acceso especiales para la descompresi&oacute;n, lectura o copia.</p>

<h4><a name="section7"></a>7. Condiciones adicionales.</h4>

<p>Los "Permisos Adicionales" son condicionantes que ampl&iacute;an los t&eacute;rminos de esta Licencia permitiendo excepciones a una o m&aacute;s de sus condiciones. Los Permisos Adicionales que son aplicables al Programa completo deber&aacute;n ser tratados como si estuviesen incluidos en esta Licencia, hasta los l&iacute;mites de validez impuestos por las leyes aplicables. Si los permisos adicionales se aplicasen s&oacute;lo a una parte del Programa, esa parte podr&iacute;a ser usada de forma independiente en virtud de dichos permisos, pero el Programa completo seguir&iacute;a estando afectado por esta Licencia con independencia de los permisos adicionales.</p>

<p>Cuando distribuya una copia de un trabajo amparado, usted podr&aacute; opcionalmente eliminar cualquier permiso adicional de esa copia, o de alguna parte del mismo. (Los permisos adicionales pueden haber establecido que sea requerida su eliminaci&oacute;n en ciertos supuestos si usted modifica el trabajo.) Usted puede establecer permisos adicionales en material a&ntilde;adido por usted a un trabajo amparado, sobre el cual tiene o podr&aacute; aportar sus permisos de copyright correspondientes.</p>

<p>Sin contravenir cualquier otra estipulaci&oacute;n en esta Licencia, usted podr&aacute;, para el material que a&ntilde;ada a un trabajo amparado, (si est&aacute; autorizado por los poseedores de copyright de ese material) a&ntilde;adir condiciones a esta Licencia con los siguientes t&eacute;rminos:</p>

<ul>
<li>a) Ausencia de garant&iacute;a o limitaci&oacute;n de responsabilidad diferente de los t&eacute;rminos establecidos en las cl&aacute;usulas 15 y 16 de esta Licencia; u </li>

<li>b) Obligaci&oacute;n de mantener determinados avisos legales razonables o atribuciones de autor&iacute;a en el material o en los Avisos Legales Correspondientes mostrados por los trabajos que lo contengan; o </li>

<li>c) Prohibir la tergiversaci&oacute;n del origen del material, o solicitar que las diferencias respecto a la versi&oacute;n original sean se&ntilde;aladas de forma apropiada en las versiones modificadas del material; o </li>

<li>d) Limitar la utilizaci&oacute;n de los nombres de los autores o beneficiarios del material con fines divulgativos; o</li>

<li>e) Negarse a ofrecer derechos afectados por leyes de registro para el uso de marcas empresariales, registradas o de servicio; o</li>

<li>f) Exigir indemnizaci&oacute;n a los autores y poseedores de la licencia de ese material, por parte de cualquier persona que distribuya el material (o versiones modificadas del mismo), estableciendo obligaciones contractuales de responsabilidad sobre el destinatario, para cualquier responsabilidad que estas obligaciones contractuales impongan directamente sobre los autores y poseedores de licencia. </li>
</ul>

<p>Cualesquiera otras condiciones adicionales no-permisivas son consideradas "otras restricciones" en el contexto de la cl&aacute;usula 10. Si el Programa, tal cual lo recibi&oacute;, o cualquier parte del mismo, contiene un aviso indicando que est&aacute; amparado por esta Licencia junto a una cl&aacute;usula de restricci&oacute;n posterior espec&iacute;fica, usted podr&aacute; suprimir esa cl&aacute;usula. Si un documento de licencia contiene una restricci&oacute;n de este tipo pero permite modificar la licencia o la distribuci&oacute;n en virtud de la presente Licencia, usted podr&aacute; a&ntilde;adirla al material de un trabajo amparado por los t&eacute;rminos de ese documento de licencia, siempre que dicha restricci&oacute;n no se mantenga tras la modificaci&oacute;n de la licencia o la distribuci&oacute;n.</p>

<p>Si a&ntilde;ade condiciones para un trabajo amparado, a tenor de lo establecido en la presente cl&aacute;usula, usted deber&aacute; ubicar, en los archivos fuente involucrados, una declaraci&oacute;n de los t&eacute;rminos adicionales aplicables a esos archivos, o un aviso indicando d&oacute;nde localizar los t&eacute;rminos aplicables.</p>

<p>Las condiciones adicionales, permisivas o no, deben aparecer por escrito como licencias separadas, o figurar como excepciones; de todas formas, los requisitos anteriores siempre son aplicables. </p>

<h4><a name="section8"></a>8. Cancelaci&oacute;n.</h4>

<p>Usted no podr&aacute; distribuir o modificar un trabajo amparado salvo de la forma en la que se ha previsto expresamente en esta Licencia. Cualquier intento diferente de distribuci&oacute;n o modificaci&oacute;n ser&aacute; considerado nulo, y autom&aacute;ticamente cancelar&aacute; sus derechos respecto a esta Licencia (incluyendo cualquier patente conseguida seg&uacute;n el p&aacute;rrafo tercero de la cl&aacute;usula 11).</p>

<p>Sin embargo, si deja de violar esta Licencia, entonces su licencia desde el poseedor del copyright correspondiente ser&aacute; restituida (a) provisionalmente, a menos que y hasta que el poseedor del copyright d&eacute; por terminada expl&iacute;cita y permanentemente su licencia, y (b) permanentemente, si el poseedor del copyright no le ha notificado por alg&uacute;n cauce de la violaci&oacute;n no despu&eacute;s de los 60 d&iacute;as posteriores al cese.</p>

<p>Adem&aacute;s, su licencia desde el poseedor del copyright correspondiente ser&aacute; restituida permanentemente si el poseedor del copyright le notifica de la violaci&oacute;n por alg&uacute;n cauce, es la primera vez que recibe la notificaci&oacute;n de violaci&oacute;n de esta Licencia (para cualquier trabajo) de ese poseedor de copyright, y usted subsana la violaci&oacute;n antes de 30 d&iacute;as desde la recepci&oacute;n del aviso.</p>

<p>La cancelaci&oacute;n de sus derechos seg&uacute;n esta cl&aacute;usula no da por canceladas las licencias de terceros que hayan recibido copias o derechos a trav&eacute;s de usted con esta Licencia. Si sus derechos han finalizado y no han sido restituidos de forma permanente, usted no est&aacute; capacitado para recibir nuevas licencias para el mismo material en virtud de la cl&aacute;usula 10.</p>

<h4><a name="section9"></a>9. Aceptaci&oacute;n no obligatoria por tenencia de copias.</h4>

<p>No est&aacute; obligado a aceptar esta Licencia por recibir o ejecutar una copia del Programa. La distribuci&oacute;n de un trabajo amparado surgida simplemente como consecuencia de la transmisi&oacute;n entre usuarios para obtener una copia tampoco requiere aceptaci&oacute;n. Sin embargo, &uacute;nicamente esta Licencia le otorga permiso para distribuir o modificar cualquier trabajo amparado. Estas acciones infringen el copyright si usted no acepta las los t&eacute;rminos y condiciones de esta Licencia. Por lo tanto, al modificar o distribuir un trabajo amparado, usted indica que acepta la Licencia.</p>

<h4><a name="section10"></a>10. Herencia autom&aacute;tica de licencia para destinatarios .</h4>

<p>Cada vez que distribuya un trabajo amparado, el destinatario recibir&aacute; autom&aacute;ticamente una licencia desde los poseedores originales, para ejecutar, modificar y distribuir ese trabajo, al amparo de los t&eacute;rminos de esta Licencia. Usted no ser&aacute; responsable de asegurar el cumplimiento por terceros de esta Licencia.</p>

<p>Una "transacci&oacute;n de entidad" es una transacci&oacute;n que transfiere el control de una organizaci&oacute;n, o todos los bienes sustanciales de una, o subdivide una organizaci&oacute;n, o fusiona organizaciones. Si la distribuci&oacute;n de un trabajo amparado surge de una transacci&oacute;n de entidad, cada parte involucrada en esa transacci&oacute;n que reciba una copia del trabajo, tambi&eacute;n recibe todas y cada una de las licencias existentes del trabajo que la parte interesada tuviese o pudiese ofrecer seg&uacute;n el p&aacute;rrafo anterior, adem&aacute;s del derecho a tomar posesi&oacute;n de las Fuentes Correspondientes del trabajo a trav&eacute;s de la parte interesada, si est&aacute; en poder de dicha parte o se puede conseguir con un esfuerzo razonable.</p>

<p>Usted no podr&aacute; imponer restricciones posteriores en el ejercicio de los derechos otorgados o concedidos en virtud de la presente Licencia. Por ejemplo, usted no puede imponer a la licencia pagos, derechos u otros cargos por el ejercicio de los derechos otorgados seg&uacute;n esta Licencia; adem&aacute;s no podr&aacute; iniciar litigios (incluyendo demandas o contrademandas en pleitos) alegando que se infringen patentes por cambiar, usar, vender, ofrecer en venta o importar el Programa, o cualquier parte del mismo.</p>

<h4><a name="section11"></a>11. Patentes.</h4>

<p>Un "colaborador" es un poseedor de copyright que autoriza el uso del Programa o un trabajo en el que se base el Programa bajo los t&eacute;rminos y condiciones establecidos en la presente Licencia. El trabajo con esta licencia se denomina "versi&oacute;n en colaboraci&oacute;n" con el colaborador.</p>

<p>Todas las reivindicaciones de patentes en posesi&oacute;n o controladas por el colaborador se denominan "demandas de patente original", ya sean existentes o adquiridas con posterioridad, que hayan sido infringidas de alguna forma permitida por esta Licencia, al hacer, usar o vender la versi&oacute;n en colaboraci&oacute;n, pero sin incluir demandas que s&oacute;lo sean infracciones como consecuencia de modificaciones posteriores de la versi&oacute;n en colaboraci&oacute;n. Para aclarar esta definici&oacute;n, "control" incluye el derecho de conceder sublicencias de patente de forma que no contravenga los requisitos establecidos en la presente Licencia.</p>

<p>Cada colaborador le concede a usted una licencia de la patente no-exclusiva, global y libre de derechos bajo las reivindicaciones de patente de origen del colaborador, para el uso, modificaci&oacute;n, venta, ofertas de venta, importaci&oacute;n y otras formas de ejecuci&oacute;n, modificaci&oacute;n y redistribuci&oacute;n del contenido de la versi&oacute;n en colaboraci&oacute;n.</p>

<p>En los siguientes tres p&aacute;rrafos, una "licencia de patente" se refiere a cualquier acuerdo o compromiso expreso y manifiesto, cualquiera que sea su denominaci&oacute;n, que no imponga una patente (como puede ser el permiso expreso para ejecutar una patente o acuerdos para no imponer demandas por infracci&oacute;n de patente). "Conceder" estas licencias de patente a un tercero significa llegar a tal tipo de acuerdo o compromiso que no imponga una patente al tercero.</p>

<p>Si usted distribuye un trabajo amparado, conociendo que est&aacute; afectado por una licencia de patente, y no est&aacute;n disponibles de forma p&uacute;blica para su copia las Fuentes Correspondientes, sin cargo alguno y bajo los t&eacute;rminos de esta Licencia, ya sea a trav&eacute;s de un servidor de red p&uacute;blico o mediante cualquier otro medio, entonces usted deber&aacute; o bien (1) permitir que sean p&uacute;blicas las Fuentes Correspondientes, o (2) tratar de eliminar los beneficios de la licencia de patente para este trabajo en particular, o (3) tratar de extender, de una forma que no contravenga los requisitos de esta Licencia, la licencia de patente a terceros. "Conocer que est&aacute; afectado" significa que usted tiene conocimiento real de que, para la licencia de patente, la distribuci&oacute;n del trabajo amparado en un determinado pa&iacute;s, o el uso del trabajo amparado por sus destinatarios en un determinado pa&iacute;s, infringir&iacute;a una o m&aacute;s patentes existentes en ese pa&iacute;s que usted considera aplicables por alg&uacute;n motivo.</p>
  
<p>Si, de conformidad con alguna transacci&oacute;n o acuerdo(o en un proceso relacionado con ellos), usted distribuye o distribuye con fines de distribuci&oacute;n , un trabajo amparado, concediendo una licencia de patente para alg&uacute;n tercero que reciba el trabajo amparado, y autoriz&aacute;ndole a usar, distribuir, modificar o distribuir una copia espec&iacute;fica del trabajo amparado, entonces la licencia de patente que usted otorgue se extiende autom&aacute;ticamente a todos los receptores del trabajo amparado y cualquier trabajo basado en el mismo.</p>

<p>Una licencia de patente es "discriminatoria" si no incluye dentro de su &aacute;mbito de cobertura, proh&iacute;be el ejercicio, o est&aacute; condicionada a no ejercitar uno o m&aacute;s de los derechos que est&aacute;n espec&iacute;ficamente otorgados por esta Licencia. Usted no debe distribuir un trabajo amparado si est&aacute; implicado en un acuerdo con terceros que est&eacute;n relacionados con el negocio de la distribuci&oacute;n de software, en el que usted haga pagos relacionados con su actividad de distribuci&oacute;n del trabajo, y donde se otorgue, a cualquier receptor del trabajo amparado, una licencia de patente discriminatoria (a) en relaci&oacute;n con las copias del trabajo amparado distribuido por usted (o copias hechas a partir de &eacute;stas), o (b) directa o indirectamente relacionadas con productos espec&iacute;ficos o paquetes que contengan el trabajo amparado, a menos que usted forme parte del acuerdo, o que esa licencia de patente fuese otorgada antes del 28 de marzo de 2007.</p>

<p>Ninguna disposici&oacute;n de esta Licencia se considerar&aacute; como excluyente o limitante de la aplicaci&oacute;n de cualquier otra licencia o defensas legales contra la violaci&oacute;n de las leyes de propiedad intelectual a que pudiera tener derecho bajo la ley de propiedad intelectual vigente.</p>

<h4><a name="section12"></a>12. No condicionamiento de la libertad de terceros.</h4>

<p>Si a usted le son impuestas condiciones que contravienen las estipuladas en la presente Licencia (ya sea por orden judicial, acuerdo u otros), no quedar&aacute; eximido de cumplir las condiciones de esta Licencia. Si usted no puede distribuir un trabajo amparado cumpliendo simult&aacute;neamente sus obligaciones con esta Licencia y con cualquier otra pertinente, entonces no podr&aacute; distribuirlo de ninguna forma. Por ejemplo, si usted se compromete con t&eacute;rminos que le obligan a obtener derechos por la distribuci&oacute;n a terceros, la &uacute;nica forma de satisfacer ambos condicionantes y esta Licencia es abstenerse completamente de distribuir el Programa.</p>

<h4><a name="section13"></a>13. Uso conjunto con la Licencia P&uacute;blica General Affero GNU.</h4>

<p>Sin contravenir las disposiciones de la presente Licencia, usted tendr&aacute; permiso para enlazar o combinar cualquier trabajo amparado con otro trabajo amparado por la versi&oacute;n 3 de la Licencia P&uacute;blica General Affero GNU y formar un solo trabajo combinado, y distribuir el trabajo resultante. Los t&eacute;rminos de esta Licencia seguir&aacute;n siendo aplicables a la parte formada por el trabajo amparado, pero los condicionantes especiales de la Licencia P&uacute;blica General Affero GNU, en su cl&aacute;usula 13, relativos a la interacci&oacute;n mediante redes, ser&aacute;n aplicables a la combinaci&oacute;n de ambas partes.</p>

<h4><a name="section14"></a>14. Versiones Revisadas de esta Licencia.</h4>

<p>La Fundaci&oacute;n para el Software Libre podr&aacute; publicar revisiones y/o nuevas versiones de la Licencia P&uacute;blica General GNU de vez en cuando. Esas versiones ser&aacute;n similares en esp&iacute;ritu a la versi&oacute;n actual, pero podr&aacute;n diferir en algunos detalles para afrontar nuevos problemas o situaciones.</p>

<p>A cada versi&oacute;n se le da un n&uacute;mero distintivo. Si el Programa especifica que le es aplicable cierto n&uacute;mero de versi&oacute;n de la Licencia P&uacute;blica General o "cualquier versi&oacute;n posterior", usted tendr&aacute; la posibilidad de adoptar los t&eacute;rminos y condiciones de la versi&oacute;n indicada o de cualquier otra versi&oacute;n posterior publicada por la Fundaci&oacute;n para el Software Libre. Si el Programa no especifica un n&uacute;mero de versi&oacute;n de la Licencia P&uacute;blica General, usted  podr&aacute; elegir cualquier versi&oacute;n que haya sido publicada por la Fundaci&oacute;n para el Software Libre.</p>

<p>Si el Programa especifica que un apoderado/representante puede decidir qu&eacute; versiones de la Licencia P&uacute;blica General pueden aplicarse en el futuro, la declaraci&oacute;n p&uacute;blica de aceptaci&oacute;n que el apoderado/representante haga de una versi&oacute;n le autoriza a usted con car&aacute;cter permanente a elegir esa versi&oacute;n para el Programa.</p>

<p>Versiones posteriores de la licencia podr&aacute;n otorgarle permisos adicionales o diferentes. Sin embargo,  no podr&aacute;n imponerse obligaciones adicionales a cualquier autor o poseedor de copyright como consecuencia de que usted adopte una versi&oacute;n posterior.</p>

<h4><a name="section15"></a>15. Ausencia de Garant&iacute;a.</h4>

<p>EL PROGRAMA NO TIENE GARANT&Iacute;A ALGUNA, HASTA LOS L&Iacute;MITES PERMITIDOS POR LAS LEYES APLICABLES. SALVO CUANDO SE ESTABLEZCA LO CONTRARIO POR ESCRITO, EL POSEEDOR DEL COPYRIGHT Y/O TERCEROS PROPORCIONAR&Aacute;N EL PROGRAMA "TAL CUAL" SIN GARANT&Iacute;A DE NING&Uacute;N TIPO, YA SEA EXPL&Iacute;CITA O IMPL&Iacute;CITA, INCLUYENDO, PERO SIN LIMITARSE A, LAS GARANT&Iacute;AS IMPL&Iacute;CITAS MERCANTILES Y DE APTITUD PARA UN PROP&Oacute;SITO DETERMINADO. USTED ASUMIR&Aacute; CUALQUIER RIESGO RELATIVO A LA CALIDAD Y RENDIMIENTO DEL PROGRAMA. SI EL PROGRAMA FUESE DEFECTUOSO, USTED ASUMIR&Aacute; CUALQUIER COSTE DE SERVICIO, REPARACI&Oacute;N O CORRECCI&Oacute;N.</p>

<h4><a name="section16"></a>16. Limitaci&oacute;n de Responsabilidad.</h4>

<p>EN NING&Uacute;N CASO, SALVO REQUERIMIENTO POR LEYES APLICABLES O MEDIANTE ACUERDO POR ESCRITO, PODR&Aacute; UN POSEEDOR DE COPYRIGHT, O UN TERCERO QUE MODIFIQUE O DISTRIBUYA EL PROGRAMA SEG&Uacute;N LO INDICADO ANTERIORMENTE, HACERLE A USTED RESPONSABLE DE DA&Ntilde;O ALGUNO, INCLUYENDO CUALQUIER DA&Ntilde;O GENERAL, ESPECIAL, OCASIONAL O DERIVADO QUE SURJA DEL USO O LA INCAPACIDAD DE USO DEL PROGRAMA (INCLUYENDO PERO SIN LIMITARSE A LA P&Eacute;RDIDA DE DATOS O LA PRESENTACI&Oacute;N NO PRECISA DE LOS MISMOS O A P&Eacute;RDIDAS SUFRIDAS POR USTED O TERCEROS O AL FALLO DEL PROGRAMA AL INTERACTUAR CON OTROS PROGRAMAS), INCLUSO EN EL CASO DE QUE EL POSEEDOR O UN TERCERO HAYA SIDO ADVERTIDO DE LA POSIBILIDAD DE TALES DA&Ntilde;OS.</p>

<h4><a name="section17"></a>17. Interpretaci&oacute;n de las cl&aacute;usulas 15 y 16.</h4>

<p>Si la ausencia de garant&iacute;a y la limitaci&oacute;n de responsabilidad descrita anteriormente no tuviesen efecto legal a nivel local en todos sus t&eacute;rminos, los juzgados aplicar&aacute;n las leyes locales que m&aacute;s se aproximen a la exenci&oacute;n de responsabilidad civil en lo relativo al Programa, a menos que la copia del Programa est&eacute; acompa&ntilde;ada mediante pago de una garant&iacute;a o compromiso de responsabilidad.</p>

<p>FIN DE T&Eacute;RMINOS Y CONDICIONES</p>

<h3><a name="howto"></a>C&oacute;mo aplicar estas condiciones a sus nuevos programas</h3>

<p>Si usted desarrolla un nuevo programa, y quiere darle al p&uacute;blico el mayor uso posible del mismo, la mejor forma de conseguirlo es hacerlo software libre para que cualquiera pueda redistribuirlo y modificarlo bajo estas condiciones.</p>

<p>Para ello, adjunte los siguientes avisos al programa. Es m&aacute;s seguro adjuntarlos al inicio de cada archivo fuente para hacer m&aacute;s expl&iacute;cita la ausencia de garant&iacute;a; y cada archivo deber&iacute;a tener al menos la l&iacute;nea de "copyright" y un enlace a la versi&oacute;n completa del aviso.</p>

<pre>    &lt;una l&iacute;nea con el nombre del programa y una breve idea de su objetivo.&gt;
    Copyright (C) &lt;a&ntilde;o&gt;  &lt;nombre del autor&gt;

    Este programa es software libre: usted puede redistribuirlo y/o modificarlo 
    bajo los t&eacute;rminos de la Licencia P&uacute;blica General GNU publicada 
    por la Fundaci&oacute;n para el Software Libre, ya sea la versi&oacute;n 3 
    de la Licencia, o (a su elecci&oacute;n) cualquier versi&oacute;n posterior.

    Este programa se distribuye con la esperanza de que sea &uacute;til, pero 
    SIN GARANT&Iacute;A ALGUNA; ni siquiera la garant&iacute;a impl&iacute;cita 
    MERCANTIL o de APTITUD PARA UN PROP&Oacute;SITO DETERMINADO. 
    Consulte los detalles de la Licencia P&uacute;blica General GNU para obtener 
    una informaci&oacute;n m&aacute;s detallada. 

    Deber&iacute;a haber recibido una copia de la Licencia P&uacute;blica General GNU 
    junto a este programa. 
    En caso contrario, consulte &lt;http://www.gnu.org/licenses/&gt;.
</pre>

<p>Incluya adem&aacute;s informaci&oacute;n de c&oacute;mo contactar con usted por correo electr&oacute;nico y ordinario.</p>

<p>Si el programa es interactivo, haga que muestre un breve aviso como el siguiente cuando se inicie en modo interactivo:</p>

<pre>    &lt;programa&gt;  Copyright (C) &lt;a&ntilde;o&gt;  &lt;nombre del autor&gt;
    Este programa se ofrece SIN GARANT&Iacute;A ALGUNA; 
    escriba 'show w' para consultar los detalles.
    Es software libre, y usted puede redistribuirlo bajo ciertas condiciones; 
    escriba 'show c' para m&aacute;s informaci&oacute;n.
</pre>

<p>Los hipot&eacute;ticos comandos 'show w' y 'show c' deber&iacute;an mostrar las partes correspondientes de la Licencia P&uacute;blica General. Por supuesto, los comandos en su programa podr&iacute;an ser diferentes; en un interfaz gr&aacute;fico de usuario, podr&iacute;a usar un mensaje del tipo "Acerca de".</p>

<p>Tambi&eacute;n deber&iacute;a conseguir que su empresa (si trabaja como programador) o escuela, en su caso, firme una "renuncia de copyright" sobre el programa, si fuese necesario. Para m&aacute;s informaci&oacute;n a este respecto, y saber c&oacute;mo aplicar y cumplir la licencia GNU GPL, consulte &lt;http://www.gnu.org/licenses/&gt;.</p>

<p>La Licencia P&uacute;blica General GNU no permite incorporar sus programas como parte de programas propietarios. Si su programa es una subrutina en una biblioteca, resultar&iacute;a mucho m&aacute;s &uacute;til habilitar el enlace de aplicaciones propietarias a la biblioteca. Si es esto lo que quiere hacer, utilice la Licencia P&uacute;blica General Reducida GNU en vez de esta Licencia. Pero por favor, consulte primero &lt;http://www.gnu.org/philosophy/why-not-lgpl.html&gt;.</p>
<hr />
  <p style="text-align: center;">
    <a href="http://validator.w3.org/check?uri=referer"><img
        src="http://www.w3.org/Icons/valid-xhtml10-blue"
        alt="Valid XHTML 1.0 Strict" height="31" width="88" /></a>
  </p>
  
</div>  
</body>
</html>
